print("Привіт, як тебе звуть?")
ne=input("напишіть імя")
re=input("хочеш почати гру? (так / ні)")
if re=="так":
    print("у тебе є координати острова зі скарбами. Як будеш добиратися?")
    print("можеш дістатись до острова")
    print("1 - підводним човном")
    print("2 - літаком")
    print("3 - короблем")
    it=input("обери число")
    if it=="1":
        print("ви досягли острова на підводному човні без пригод")
    if it =='2':
        print("ви досягли острова на літаку без пригод")
    if it == '3':
        print("ви досягли острова на кораблі без пригод")
    print("На острові вас зустріла невідома істота. Що будемо робити?")
    print("1 - битися")
    print("2 - тихесенко обійти")
    na=input("обери число")
    if na=="1":
        print("Оберіть зброю")
        print("1 - ніж")
        print("2 - пістолет")
        iw=input("обири цифру")
        if iw == '1':
            print("Ви не змогли перемогти істоту і загинули")
        if iw == '2':
            print('Ви перемогли істоту, але вас важко поранено. Ваші дії...')
            print("1 - покличу на допомогу")
            print("2 - використаю аптечку")
            ans = input('Оберіть дію')
            if ans == '1':
                print('Ви покликали на допомогу')
                print('Нажаль, на цьому острові нікого немає')
                print('Ви програли')
            if ans == '2':
                print('Ви зупинили кровотечу та можете продовжувати рух')
                print('1 - продовжити пошук скарбу')
                print('2 - повернутись додому')
                print('введіть число')
                diya = input()
                if diya == '2':
                    print('Ви повернулись додому, але так і не знайшли скарб. Ви програли')
                if diya == '1':
                    print('Ви продовжили пошук скарбу')
                    print('Вирушили в дорогу')
                    print('Сутеніє...')
                    print('1 - відпочити. 2 - продовжити пошук')
                    ans = input()
                    if ans == '2':
                        print('Ви продовжили пошук, але в темряві заблукали.')
                        print('Тепер ви не розумієте, де знаходитесь і навряд зможете повернутись')
                        print('Ви програли')
                    if ans == '1':
                        print('Ви знайшли печеру, у якій можна переночувати')
                        print('Світає')
                        print('Ви готові вирушати на пошуки')
                        ans = input('Уперед!')
                        print('Ви дійшли до місця, вказаного на мапі!')
                        print('Вітаю, ви знайшли скарби!')
    if na == '2':
        print('Ви обійшли істоту. Здається, вона вас не помітила...')
        print('Ви продовжили пошук скарбу')
        print('Вирушили в дорогу')
        print('Сутеніє...')
        print('1 - відпочити. 2 - продовжити пошук')
        ans = input()
        if ans == '2':
            print('Ви продовжили пошук, але в темряві заблукали.')
            print('Тепер ви не розумієте, де знаходитесь і навряд зможете повернутись')
            print('Ви програли')
        if ans == '1':
            print('Ви знайшли печеру, у якій можна переночувати')
            print('Світає')
            print('Ви готові вирушати на пошуки')
            ans = input('Уперед!')
            print('Ви дійшли до місця, вказаного на мапі!')
            print('Вітаю, ви знайшли скарби!')            


            
            
            